table_35kv_company_string = '''
序号	用户名称	电压	同比	环比	行业类型	镇街
		等级（kV）	（%）	（%）		
1	浙江盛元化纤有限公司	110	↓25.7%	↑33.0%	化学纤维制造业	益农镇
2	浙江恒逸石化有限公司	110	↑4.9%	↓4.4%	化学纤维制造业	衙前镇
3	中国重汽集团杭州发动机有限公司	110	↑295.3%	↑236.8%	汽车制造业	开发区
4	兴惠化纤集团有限公司	35	↑5.4%	↑0.6%	纺织业	衙前镇
5	开氏集团有限公司	35	↑9.0%	↓8.4%	纺织业	衙前镇
6	杭州惠丰化纤有限公司	35	↑1.8%	↑5.4%	纺织业	衙前镇
7	三元控股集团有限公司	35	↑12.8%	↓11.4%	纺织业	党湾镇
8	万向一二三股份公司	35	↓10.0%	↓18.8%	电气机械和器材制造业	宁围街道
9	万向钱潮股份公司	35	↓3.1%	↓5.3%	电气机械和器材制造业	宁围街道
10	浙江森楷新材料有限公司	35	↑115.0%	↑13.4%	纺织业	瓜沥镇
11	浙江开氏实业有限公司	35	↑2.7%	↓4.5%	纺织业	衙前镇
12	杭州航民达美染整有限公司	35	↑68.1%	21.30%	纺织业	瓜沥镇
13	杭州青云新材料股份有限公司	35	↑3.9%	↓2.7%	纺织业	衙前镇
14	浙江方欣新材料有限公司	35	↑1.8%	↓12.3%	纺织业	瓜沥镇
15	杭州帝凯工业布有限公司	35	↑14.3%	↓3.4%	纺织业	瓜沥镇
16	杭州中彩特种纤维有限公司	35	↑24.5%	↑7.0%	化学纤维制造业	瓜沥镇
17	浙江协和薄钢科技有限公司	35	↓0.7%	↑17.8%	金属制造业	红山农场
18	杭州瑞成辉化纤有限公司	35	↓4.3%	↓19.6%	化学纤维制造业	新街街道
19	浙江宏扬纺织科技有限公司	35	↑14.4%	↑6.9%	纺织业	瓜沥镇
20	浙江萧元中沙纺织有限公司	35	↑9.6%	↓1.2%	纺织业	瓜沥镇
21	杭州萧越染织有限公司	35	↑15.4%	↓17.5%	纺织业	瓜沥镇
22	浙江拓源钢铁有限责任公司	35	↓8.0%	↓2.6%	金属制造业	衙前镇
23	浙江佳力风能技术有限公司	35	↑8.8%	↑9.0%	通用设备制造业	瓜沥镇
24	恒枫食品科技有限公司	35	↑80.8%	↓32.1%	食品制造业	开发区
25	华润雪花啤酒(浙江)有限公司	35	↑14.4%	↓63.6%	酒、饮料和精制茶制造业	新街街道
26	杭州前进齿轮箱集团股份有限公司	35	↓1.1%	↓13.0%	电气机械及器材制造业	城厢街道
27	爱克斯精密钢球(杭州)有限公司	35	↑1.8%	↓4.6%	通用设备制造业	开发区
28	杭萧钢构股份有限公司	35	↓28.6%	↑2.7%	金属制造业	新街街道
29	杭州宏胜恒枫饮料有限公司	35	↑89.7%	↓12.9%	酒、饮料和精制茶制造业	开发区
30	浙江协和陶瓷有限公司	35	↓27.2%	↑54.9%	金属制造业	红山农场
31	奥伯尼工程纺织品(杭州)有限公司	35	↑0.1%	↓31.5%	纺织业	开发区
32	浙江双可达纺织有限公司	35	↓10.7%	↑7.6%	纺织业	河上镇
33	杭州雅马哈乐器有限公司	35	↓59.9%	↓59.0%	专用设备制造业	瓜沥镇
'''

table_analysis_string = '''
序号	表名	报告期别	填报范围
1	区域电网电量交换情况	年报	国家电网有限公司总(分)部、各省级电网公司；中国南方电网有限责任公司及其所属各省电网公司；内蒙古电力（集团）有限责任公司
2	供用电综合情况	年报	全部供电部分包括电网公司、自备发电厂、售电公司、微电网及其他企业的供用电总和
3	电量平衡情况	年报	电力企业和自备发电厂及其他企业的发用电总和
4	全社会用电分类情况	年报	本区域内全部用户和电力企业
5	分城市全社会用电分类情况	年报	本区域内全部用户和电力企业
6	电网负荷特性	年报	统一调度电网
7	35千伏及以上线路情况	年报	35千伏(含22千伏)及以上的线路，不包括已经批准报废的线路
8	35千伏及以上变电站和换流站情况	年报	35千伏(含22千伏)及以上的公用和企业自备的变电站、变压器情况（不包括已经批准报废的和租借其他单位的变压器）、开关站、电厂的升压变情况
9	系统无功补偿设备情况	年报	35千伏及以上的各类无功补偿设备
10	区域电网电量交换情况	月报	国家电网有限公司总(分)部、各省级电网公司；中国南方电网有限责任公司及其所属各省电网公司；内蒙古电力（集团）有限责任公司
11	供用电综合情况	月报	全部供电部分包括电网公司、自备发电厂、售电公司、微电网及其他企业的供用电总和
12	电量平衡情况	月报	电力企业和自备发电厂及其他企业的发用电总和
13	全社会用电分类情况	月报	本区域内全部用户和电力企业
14	分城市全社会用电分类情况	月报	本区域内全部用户和电力企业
15	电网负荷特性	月报	统一调度电网
16	发电基本情况	年报	（本区域/企业）全部电厂
17	新型储能电站基本情况	年报	（本区域/企业）全部新型储能电站
18	发电设备情况	年报	（本区域/企业）全部电厂
19	新型储能电站设备情况	年报	（本区域/企业）全部新型储能电站
20	新投发电设备情况	年报	（本区域/企业）全部6000千瓦及以上电厂
21	关停发电设备情况	年报	（本区域/企业）全部6000千瓦及以上电厂
22	发电机组运行情况	年报	（本区域/企业）全部6000千瓦及以上电厂的机组
23	发电生产情况	年报	（本区域/企业）全部电厂
24	6000千瓦及以上电厂发电生产情况汇总	年报	（本区域/企业）全部6000千瓦及以上电厂
25	6000千瓦及以上电厂发电生产用电情况	年报	（本区域/企业）全部6000千瓦及以上电厂
26	6000千瓦及以上电厂发电燃料消耗情况	年报	（本区域/企业）全部6000千瓦及以上电厂
27	6000千瓦及以上电厂供热生产情况	年报	（本区域/企业）全部6000千瓦及以上电厂
28	发电生产能力平衡情况	年报	（本区域/企业）全部电厂
29	分布式发电生产情况	年报	（本区域/企业）全部分布式发电厂
30	新型储能电站运行情况	年报	（本区域/企业）全部新型储能电站
31	抽水蓄能电站运行情况	年报	（本区域/企业）全部抽水蓄能电站
32	发电生产情况	月报	（本区域/企业）全部电厂
33	6000千瓦及以上电厂发电生产情况汇总	月报	（本区域/企业）全部6000千瓦及以上电厂
34	6000千瓦及以上电厂发电生产用电情况	月报	（本区域/企业）全部6000千瓦及以上电厂
35	6000千瓦及以上电厂发电燃料消耗情况	月报	（本区域/企业）全部6000千瓦及以上电厂
36	6000千瓦及以上电厂供热生产情况	月报	（本区域/企业）全部6000千瓦及以上电厂
37	发电生产能力平衡情况	月报	（本区域/企业）全部电厂
38	分布式发电生产情况	月报	（本区域/企业）全部分布式发电厂
39	新型储能电站运行情况	月报	（本区域/企业）全部新型储能电站
40	抽水蓄能电站运行情况	月报	（本区域/企业）全部抽水蓄能电站
41	电源固定资产投资完成情况	年报	全部电源基建和技改项目
42	电源项目建设规模和新增生产能力情况	年报	全部电源基建和技改项目
43	电源固定资产投资完成情况汇总	年报	全部电源基建和技改项目
44	电源固定资产投资完成情况	月报	全部电源基建和技改项目
45	电源项目建设规模和新增生产能力情况	月报	全部电源基建和技改项目
46	电源固定资产投资完成情况汇总	月报	全部电源基建和技改项目
47	电网固定资产投资完成情况	年报	全部电源投资、电网投资、小型基建投资、非生产性技改投资等
48	电网基建投资完成情况	年报	全部电压等级电网建设项目及小型基建项目，不含技改
49	电网项目建设规模和新增生产能力情况	年报	全部电压等级电网建设项目，不含技改
50	电网固定资产投资完成情况	月报	全部电源投资、电网投资、小型基建投资、非生产性技改投资等
51	电网基建投资完成情况	月报	全部电压等级电网建设项目及小型基建项目，不含技改
52	电网项目建设规模和新增生产能力情况	月报	全部电压等级电网建设项目，不含技改
53	县级供电企业电量情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
54	县级供电企业供电服务情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
55	县级供电企业电价及同价情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
56	县级供电企业基本情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
57	县级供电区域电源情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
58	县级供电企业供电设备情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
59	县级供电企业用电客户情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
60	县级供电企业电网建设情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
61	县级供电企业资产财务情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
62	县级供电企业综合情况	年报	国家电网有限公司、中国南方电网有限责任公司、内蒙古电力（集团）有限责任公司等所属县级供电企业
63	发电主设备主要可靠性情况	年报	100MW及以上容量火电机组（燃煤、燃气）、核电机组、40MW及以上容量水电机组（常规、抽水蓄能）、50MW及以上容量风力发电场（陆上、海上）、10MW及以上容量并网光伏发电站
64	发电主设备制造厂家主要可靠性情况	年报	100MW及以上容量火电机组（燃煤、燃气）、核电机组、40MW及以上容量水电机组（常规、抽水蓄能）、50MW及以上容量风力发电场（陆上、海上）、10MW及以上容量并网光伏发电站
65	发电辅机主要可靠性情况	年报	200MW及以上容量燃煤机组辅机
66	输变电设施主要可靠性情况	年报	110kV及以上交直流输变电设施
67	直流输电系统主要可靠性情况	年报	直流输电系统
68	用户供电主要可靠性及电压情况	年报	10（6、20）kV及以上用户
69	发电主设备主要可靠性情况	月报	100MW及以上容量火电机组（燃煤、燃气）、核电机组、40MW及以上容量水电机组（常规、抽水蓄能）
70	发电主设备制造厂家主要可靠性情况	月报	100MW及以上容量火电机组（燃煤、燃气）、核电机组、40MW及以上容量水电机组（常规、抽水蓄能）
71	用户供电主要可靠性及电压情况	月报	10（6、20）千伏及以上用户
72	发电主设备主要可靠性情况	季报	50MW及以上容量风力发电场（陆上、海上）、10MW及以上容量并网光伏发电站
73	发电主设备制造厂家主要可靠性情况	季报	50MW及以上容量风力发电场（陆上、海上）、10MW及以上容量并网光伏发电站
74	发电辅机主要可靠性情况	季报	200MW及以上容量燃煤机组辅机
75	输变电设施主要可靠性情况	季报	110kV及以上交直流输变电设施
76	直流输电系统主要可靠性情况	季报	直流输电系统
77	人力资源基本情况	年报	电力行业各单位的固定及合同制职工
78	职工在职学历教育	年报	电力行业各单位的固定及合同制职工
79	职工在职培训情况	年报	电力行业各单位的固定及合同制职工
80	企业职工教育培训机构情况	年报	电力行业各单位的固定及合同制职工
81	从业人员职称（技能）等级结构地区分布情况	年报	电力行业各单位的固定及合同制职工
82	各类优秀人才情况	年报	电力行业各单位的固定及合同制职工
83	职工变动及教育培训经费使用情况	年报	电力行业各单位的固定及合同制职工
84	燃料情况	年报	全厂容量在6000千瓦及以上的发电厂
85	环保设备情况	年报	全厂容量在6000千瓦及以上的发电厂
86	大气污染物和温室气体排放情况	年报	全厂容量在6000千瓦及以上的发电厂
87	用水、排水情况	年报	全厂容量在6000千瓦及以上的发电厂
88	固体废物综合利用情况	年报	全厂容量在6000千瓦及以上的发电厂
89	环境税费缴纳情况	年报	全厂容量在6000千瓦及以上的发电厂
90	环保改造投入情况	年报	全厂容量在6000千瓦及以上的发电厂
91	绩效指标情况	年报	全厂容量在6000千瓦及以上的发电厂
92	企业基本信息总情况	年报	各电网公司、发电集团
93	知识产权情况	年报	各电网公司、发电集团
94	技术标准及获奖情况	年报	各电网公司、发电集团
95	企业信息化基本建设情况	年报	各电网公司、发电集团
96	企业信息化投入产出情况	年报	各电网公司、发电集团
97	企业信息化应用及信息安全情况	年报	各电网公司、发电集团
98	企业信息化培训及信息化人才情况	年报	各电网公司、发电集团
99	电力建设企业投产情况	年报	全口径（包括所有机组和电压等级的项目）
100	主要施工机械设备情况	年报	有总承包和专业资质的建筑业法人企业
101	当年投产主要火电工程工期情况	年报	20万千瓦及以上火电机组
102	下年度发电机组预计投产情况	年报	全口径
103	当年竣工主要送变电工程工期情况	年报	全口径
104	当年竣工主要水利水电工程工期情况	年报	全口径
105	电力建设企业人员持证情况	年报	有总承包和专业资质的建筑业法人企业
106	电力工程调试企业基本情况	年报	电力工程调试企业
107	电力工程调试企业服务能力情况	年报	电力工程调试企业
108	电力工程调试企业生产经营情况	年报	电力工程调试企业
109	电力工程调试企业财务情况	年报	电力工程调试企业
110	火力发电厂基本情况	年报	全部火电发电厂
111	燃煤发电厂生产与煤炭供耗存情况	日报	全部燃煤发电厂
112	燃气发电厂生产与燃气供耗存情况	日报	全部燃气发电厂
113	燃煤发电厂生产情况	日报	全部燃煤发电厂
114	煤炭中长期合同履约情况	日报	全部煤炭采购中长期合同签订主体
115	火力发电厂燃料月度计划和经营情况	日报	全部煤炭采购中长期合同签订主体
116	发电工程造价情况	年报	新建燃煤发电机组、燃气-蒸汽联合循环机组、常规水电工程、抽水蓄能电站工程、核电工程、陆上风电工程、海上风电工程、光伏发电工程和光热发电工程的概算、决算动态投资和主要设备价格情况
117	电网工程造价情况	年报	新建交流变电站工程、直流换流站工程、充换电站工程、架空输电线路工程、陆上电缆输电线路工程、水下/海底电缆输电线路工程、电化学储能工程的概算、决算动态投资、主要设备价格情况
118	发电工程造价情况	季报	新建燃煤发电机组、燃气-蒸汽联合循环机组、常规水电工程、抽水蓄能电站工程、核电工程、陆上风电工程、海上风电工程、光伏发电工程和光热发电工程的概算、决算动态投资和主要设备价格情况
119	电网工程造价情况	季报	新建交流变电站工程、直流换流站工程、充换电站工程、架空输电线路工程、陆上电缆输电线路工程、水下/海底电缆输电线路工程、电化学储能工程的概算、决算动态投资、主要设备价格情况
'''